cf/InformationRegisters/ProductPrices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ProductPrices</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>PriceType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ProductPrices/Ext/ManagerModule.bsl
Function ProductPrice(Product, Val Date = Undefined) Export

	If Date = Undefined Then
		Date = CurrentSessionDate();
	EndIf;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	ProductPricesSliceLast.Price AS Price
	|FROM
	|	InformationRegister.ProductPrices.SliceLast(&Period, Product = &Product) AS ProductPricesSliceLast";

	Query.SetParameter("Period", Date);
	Query.SetParameter("Product", Product);
	
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Price;
	Else
		Return 0;
	EndIf;
	
EndFunction
